validation/AMR/damBreak/RANS/2D/system/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

yPlus
{
  type            yPlus;
  libs            ("libutilityFunctionObjects.so");

  writeControl    adjustableRunTime;
  writeInterval   0.01;

  patches         (walls bottom object);
}

// ************************************************************************* //
